overview.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Overview of Fan</title>
<!-- 2013-05-30 Thu 17:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Hongbo Zhang"/>
<link rel="stylesheet" type="text/css" href="stylesheets/styles.css" />
</head>
<body>
<div id="content">
<h1 class="title">Overview of Fan</h1>
<p>
There is a paper, which gives a high-level priciple about how Fan
works, available here <a href="pdf/metaprogramming_for_ocaml.pdf">pdf/metaprogramming_for_ocaml.pdf</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">The philosophy</h2>
<div class="outline-text-2" id="text-1">
<p>
Unlike traditional programming languages, Fan is <i>a set of
languages</i> which can <i>evolve</i> itself incrementally. It gets
started from the vanilla OCaml language as Fan<sub>0</sub>, with more and
more new languages added for each version.
</p>

<p>
For example, to add a new <a href="http://en.wikipedia.org/wiki/Domain-specific_language">DSL</a> into Fan<sub>n</sub>, we would supply a
front-end and a back-end targeted at Fan<sub>n</sub>, upon being integrated,
Fan<sub>n</sub> becomes Fan<sub>n+1</sub>.
</p>

<p>
We can grow Fan endlessly in such a way, however, the main
interesting part for Fan is not that I, the main developer of Fan
can keep adding features to it, its interesting point lies in
the following two aspects:
</p>

<ol class="org-ol">
<li>It encourages the programmer to think about programming in a
bottom-up way.  Unlike the traditional problem-oriented approach,
language-oriented programming is encouraged: delimited domain
specific language(<a href="ddsl.html">DDSL</a>) is the best abstraction for a specific
domain.
</li>

<li>Everyone, including you: the reader,  can join and develop a
mini-compiler and share with other people. Fan servers as a
platform to glue them tegether.
</li>
</ol>
</div>
</div>
</div>
</body>
</html>